In [ ]:
#!pip install pandas
#!pip install faker

In [6]:
import sqlite3
from faker import Faker
from random import randint, choice
import pandas as pd

In [7]:
fake = Faker('pt_BR')

# Conectando e entendendo o banco criado pelo Django

In [8]:
conn = sqlite3.connect('db.sqlite3')

In [9]:
cur = conn.cursor()

## Vendo os nomes das tabelas que o Django criou

In [10]:
query = '''
SELECT name
FROM sqlite_master 
WHERE type ='table' AND name NOT LIKE 'sqlite_%';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c)

('django_migrations',)
('auth_group_permissions',)
('auth_user_groups',)
('auth_user_user_permissions',)
('django_admin_log',)
('django_content_type',)
('auth_permission',)
('auth_group',)
('auth_user',)
('pages_interesses',)
('django_session',)
('pages_aluno',)
('pages_perguntas',)
('pages_aluno_interesses',)

## Acessando cada tabela

In [11]:
df = pd.read_sql_query('SELECT * FROM pages_interesses', conn)
df.head()

   id categoria  grau        nome
0   1      Arte     1      Musica
1   2      Arte     1       Dança
2   3      Arte     1  Literatura
3   4      Arte     1       Museu
4   5      Arte     1      Cinema

In [12]:
df = pd.read_sql_query('SELECT * FROM pages_aluno', conn)
df.head()

,id,nome,idade,sexo,curso,periodo
0,1,Dra. Milena Moura,F,30,Ciência de Dados e Inteligência Artificial,3
1,2,Laura Dias,F,31,Ciência de Dados e Inteligência Artificial,4
2,3,Bernardo Silva,M,30,Ciência de Dados e Inteligência Artificial,4
3,4,Lucas Gabriel Silva,F,17,Matemática Aplicada,6
4,5,Maria Cecília Viana,F,32,Matemática Aplicada,3

In [13]:
df = pd.read_sql_query('SELECT * FROM pages_aluno_interesses', conn)
df.head()

Empty DataFrame
Columns: [id, aluno_id_id, interesses_id_id]
Index: []

## Zerando os dados das tabelas

In [14]:
cur.execute('DELETE FROM pages_interesses')
cur.execute('DELETE FROM pages_aluno')
cur.execute('DELETE FROM pages_aluno_interesses')

In [15]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

In [16]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

In [17]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(15):
    print(c)

# Criando dados fakes

## Tabela pages_interesses

In [18]:
categorias = []
categorias.extend(['Arte']*6)
categorias.extend(['Esporte']*10)
categorias.extend(['Entretenimento']*5)
categorias.extend(['Estilos de Música']*12)
categorias.extend(['Social']*9)

In [19]:
nomes = ['Musica', 'Dança', 'Literatura', 'Museu', 'Cinema', 'Teatro',
'Xadrez', 'Volei', 'Futebol', 'Handbol', 'Basquete', 'Tenis de Mesa', 'Natação', 'Crossfit', 'Musculação', 'Golfe',
'Jogos', 'Séries', 'Filmes', 'Novelas', 'Livros',
'Pop', 'Samba', 'Pagode', 'Sertanejo', 'R&B', 'Jazz', 'Blues', 'Piseiro', 'KPOP', 'Funk', 'Rap', 'Trap',
'Festas', 'Boate', 'Churrasco', 'Roda de Samba', 'Passeio no Parque', 'Praia', 'Trilha', 'Piquenique', 'Montanhas']

In [20]:
graus = []
graus.extend([1]*42)
graus.extend([2]*42)
graus.extend([3]*42)
graus.extend([4]*42)
graus.extend([5]*42)

In [21]:
ids = range(1,211)

In [22]:
categorias.extend(categorias*4)
nomes.extend(nomes*4)

In [23]:
interesses = {
    'id': ids,
    'categoria': categorias,
    'grau': graus,
    'nome': nomes
}
df_int = pd.DataFrame(interesses)

In [24]:
df_int

      id categoria  grau               nome
0      1      Arte     1             Musica
1      2      Arte     1              Dança
2      3      Arte     1         Literatura
3      4      Arte     1              Museu
4      5      Arte     1             Cinema
..   ...       ...   ...                ...
205  206    Social     5  Passeio no Parque
206  207    Social     5              Praia
207  208    Social     5             Trilha
208  209    Social     5         Piquenique
209  210    Social     5          Montanhas

[210 rows x 4 columns]

## Tabela pages_alunos

In [25]:
alunos = {
    'id': [],
    'nome':[],
    'idade':[],
    'sexo':[],
    'curso':[],
    'periodo':[]
}


for id in range(1,401):
    alunos['id'].append(id)
    alunos['nome'].append(fake.name())
    alunos['idade'].append(randint(15,50))
    alunos['sexo'].append(choice(['M','F']))
    alunos['curso'].append(choice(['Ciência de Dados e Inteligência Artificial', 'Matemática Aplicada']))
    alunos['periodo'].append(randint(1,8))

In [26]:
df_alunos = pd.DataFrame(alunos)

In [27]:
df_alunos

,id,nome,idade,sexo,curso,periodo
0,1,João Gabriel Barbosa,46,F,Matemática Aplicada,3
1,2,Dr. Davi das Neves,22,M,Ciência de Dados e Inteligência Artificial,5
2,3,Yuri Barbosa,26,F,Matemática Aplicada,5
3,4,Luiz Fernando Souza,49,M,Ciência de Dados e Inteligência Artificial,7
4,5,Stella Nunes,16,F,Matemática Aplicada,2
...,...,...,...,...,...,...
395,396,Manuela Rocha,21,M,Matemática Aplicada,1
396,397,Diogo Moraes,42,M,Ciência de Dados e Inteligência Artificial,6
397,398,Maria Barbosa,28,M,Ciência de Dados e Inteligência Artificial,3
398,399,Cecília da Cruz,39,F,Ciência de Dados e Inteligência Artificial,2
399,400,Sra. Sofia Vieira,31,M,Matemática Aplicada,7

## Tabela pages_interesses_alunos

In [30]:
aluno_interesses = {
    'id': [],
    'aluno_id_id': [],
    'interesses_id_id': []
}

In [31]:
for id in range(1, 1501):
    aluno_interesses['id'].append(id),
    aluno_interesses['aluno_id_id'].append(randint(1,400)),
    aluno_interesses['interesses_id_id'].append(randint(1,210))

In [32]:
df_alunos_interesses = pd.DataFrame(aluno_interesses)
df_alunos_interesses

        id  aluno_id_id  interesses_id_id
0        1          197                89
1        2           37               149
2        3          194                34
3        4          337               125
4        5          146               174
...    ...          ...               ...
1495  1496          350               178
1496  1497           82                99
1497  1498          321                24
1498  1499          222                47
1499  1500           39               191

[1500 rows x 3 columns]

# Registrando dados no banco

In [33]:
data_int = []
for i in range(0,len(df_int)):
    tuple = (int(df_int['id'][i]), str(df_int['categoria'][i]), int(df_int['grau'][i]), (str(df_int['nome'][i])))
    data_int.append(tuple)

In [34]:
cur.executemany('INSERT INTO pages_interesses VALUES (?,?,?,?)', data_int)

In [35]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

(1, 'Arte', 1, 'Musica')
(2, 'Arte', 1, 'Dança')
(3, 'Arte', 1, 'Literatura')
(4, 'Arte', 1, 'Museu')
(5, 'Arte', 1, 'Cinema')
(6, 'Arte', 1, 'Teatro')
(7, 'Esporte', 1, 'Xadrez')
(8, 'Esporte', 1, 'Volei')
(9, 'Esporte', 1, 'Futebol')
(10, 'Esporte', 1, 'Handbol')
(11, 'Esporte', 1, 'Basquete')
(12, 'Esporte', 1, 'Tenis de Mesa')
(13, 'Esporte', 1, 'Natação')
(14, 'Esporte', 1, 'Crossfit')
(15, 'Esporte', 1, 'Musculação')

In [36]:
data_alunos = []
for i in range(0,len(df_alunos)):
    tuple = (int(df_alunos['id'][i]), str(df_alunos['nome'][i]), str(df_alunos['sexo'][i]), int(df_alunos['idade'][i]), str(df_alunos['curso'][i]), int(df_alunos['periodo'][i]))
    data_alunos.append(tuple)

In [37]:
cur.executemany('INSERT INTO pages_aluno VALUES (?,?,?,?,?,?)', data_alunos)

In [38]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

(1, 'João Gabriel Barbosa', 'F', '46', 'Matemática Aplicada', 3)
(2, 'Dr. Davi das Neves', 'M', '22', 'Ciência de Dados e Inteligência Artificial', 5)
(3, 'Yuri Barbosa', 'F', '26', 'Matemática Aplicada', 5)
(4, 'Luiz Fernando Souza', 'M', '49', 'Ciência de Dados e Inteligência Artificial', 7)
(5, 'Stella Nunes', 'F', '16', 'Matemática Aplicada', 2)
(6, 'Isis Viana', 'F', '15', 'Ciência de Dados e Inteligência Artificial', 5)
(7, 'Ian Viana', 'M', '19', 'Matemática Aplicada', 4)
(8, 'André Nogueira', 'F', '17', 'Matemática Aplicada', 2)
(9, 'Ana Laura Nascimento', 'F', '20', 'Ciência de Dados e Inteligência Artificial', 4)
(10, 'Paulo Rocha', 'M', '49', 'Ciência de Dados e Inteligência Artificial', 3)
(11, 'Yago da Conceição', 'F', '44', 'Ciência de Dados e Inteligência Artificial', 1)
(12, 'Davi Luiz Rodrigues', 'M', '27', 'Ciência de Dados e Inteligência Artificial', 1)
(13, 'Stephany Silveira', 'F', '17', 'Ciência de Dados e Inteligência Artificial', 1)
(14, 'Igor Mendes', 'M', '36', 'Ciência de Dados e Inteligência Artificial', 3)
(15, 'Vicente Lima', 'F', '46', 'Matemática Aplicada', 7)

In [39]:
data_int_alunos = []
for i in range(0,len(df_alunos_interesses)):
    tuple = (int(df_alunos_interesses['id'][i]), int(df_alunos_interesses['aluno_id_id'][i]), int(df_alunos_interesses['interesses_id_id'][i]))
    data_int_alunos.append(tuple)

In [40]:
cur.executemany('INSERT INTO pages_aluno_interesses VALUES (?,?,?)', data_int_alunos)

In [41]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(500):
    print(c)

(1, 197, 89)
(2, 37, 149)
(3, 194, 34)
(4, 337, 125)
(5, 146, 174)
(6, 24, 154)
(7, 337, 130)
(8, 330, 142)
(9, 121, 74)
(10, 355, 180)
(11, 221, 159)
(12, 174, 45)
(13, 301, 39)
(14, 391, 168)
(15, 125, 88)
(16, 261, 10)
(17, 138, 167)
(18, 91, 48)
(19, 354, 7)
(20, 317, 8)
(21, 351, 123)
(22, 292, 65)
(23, 15, 176)
(24, 222, 112)
(25, 385, 49)
(26, 146, 111)
(27, 102, 29)
(28, 9, 192)
(29, 263, 77)
(30, 170, 192)
(31, 261, 36)
(32, 289, 114)
(33, 6, 37)
(34, 11, 122)
(35, 50, 180)
(36, 323, 75)
(37, 193, 154)
(38, 87, 76)
(39, 337, 105)
(40, 214, 79)
(41, 246, 137)
(42, 37, 180)
(43, 71, 100)
(44, 35, 96)
(45, 333, 156)
(46, 75, 58)
(47, 143, 148)
(48, 339, 16)
(49, 91, 172)
(50, 217, 162)
(51, 333, 112)
(52, 376, 60)
(53, 95, 57)
(54, 348, 200)
(55, 224, 198)
(56, 363, 83)
(57, 220, 102)
(58, 253, 165)
(59, 276, 17)
(60, 61, 28)
(61, 29, 114)
(62, 247, 21)
(63, 269, 158)
(64, 161, 69)
(65, 13, 129)
(66, 363, 89)
(67, 321, 144)
(68, 46, 121)
(69, 55, 181)
(70, 155, 184)
(71, 311, 75)
(72, 202, 84)
(73, 178, 45)
(74, 134, 98)
(75, 80, 134)
(76, 15, 50)
(77, 369, 138)
(78, 400, 147)
(79, 333, 48)
(80, 26, 210)
(81, 1, 99)
(82, 328, 161)
(83, 100, 60)
(84, 118, 207)
(85, 20, 127)
(86, 144, 153)
(87, 9, 59)
(88, 298, 126)
(89, 50, 114)
(90, 186, 128)
(91, 83, 61)
(92, 59, 157)
(93, 277, 65)
(94, 68, 172)
(95, 149, 33)
(96, 377, 13)
(97, 378, 136)
(98, 319, 157)
(99, 123, 99)
(100, 131, 103)
(101, 308, 160)
(102, 209, 73)
(103, 64, 146)
(104, 95, 198)
(105, 399, 173)
(106, 139, 188)
(107, 339, 57)
(108, 174, 105)
(109, 361, 150)
(110, 20, 178)
(111, 43, 195)
(112, 53, 206)
(113, 139, 207)
(114, 290, 104)
(115, 199, 174)
(116, 391, 139)
(117, 169, 70)
(118, 101, 135)
(119, 171, 119)
(120, 1, 42)
(121, 93, 34)
(122, 8, 190)
(123, 321, 136)
(124, 99, 191)
(125, 172, 137)
(126, 23, 47)
(127, 50, 92)
(128, 41, 79)
(129, 267, 74)
(130, 332, 68)
(131, 114, 100)
(132, 292, 63)
(133, 212, 151)
(134, 255, 79)
(135, 289, 127)
(136, 183, 47)
(137, 62, 207)
(138, 218, 49)
(139, 55, 187)
(140, 16, 139)
(141, 223, 104)
(142, 197, 56)
(143, 280, 31)
(144, 386, 128)
(145, 4, 190)
(146, 156, 167)
(147, 310, 10)
(148, 348, 163)
(149, 49, 33)
(150, 208, 150)
(151, 387, 149)
(152, 364, 183)
(153, 324, 67)
(154, 234, 210)
(155, 229, 195)
(156, 84, 144)
(157, 6, 62)
(158, 60, 175)
(159, 333, 189)
(160, 189, 165)
(161, 29, 121)
(162, 276, 119)
(163, 313, 125)
(164, 112, 76)
(165, 187, 25)
(166, 145, 35)
(167, 244, 95)
(168, 361, 106)
(169, 115, 83)
(170, 35, 107)
(171, 377, 201)
(172, 8, 125)
(173, 15, 75)
(174, 368, 105)
(175, 394, 66)
(176, 222, 63)
(177, 376, 129)
(178, 261, 72)
(179, 342, 118)
(180, 133, 177)
(181, 379, 194)
(182, 103, 136)
(183, 60, 41)
(184, 126, 41)
(185, 367, 65)
(186, 15, 143)
(187, 100, 110)
(188, 198, 105)
(189, 83, 66)
(190, 177, 120)
(191, 99, 92)
(192, 346, 76)
(193, 247, 14)
(194, 5, 154)
(195, 359, 73)
(196, 73, 194)
(197, 69, 104)
(198, 324, 181)
(199, 300, 181)
(200, 155, 54)
(201, 233, 53)
(202, 386, 133)
(203, 355, 45)
(204, 77, 189)
(205, 19, 207)
(206, 340, 87)
(207, 319, 142)
(208, 105, 105)
(209, 120, 131)
(210, 312, 190)
(211, 290, 169)
(212, 72, 96)
(213, 164, 116)
(214, 369, 195)
(215, 151, 172)
(216, 351, 155)
(217, 376, 91)
(218, 186, 92)
(219, 249, 71)
(220, 235, 101)
(221, 375, 149)
(222, 71, 203)
(223, 107, 120)
(224, 306, 5)
(225, 16, 174)
(226, 358, 15)
(227, 260, 77)
(228, 66, 20)
(229, 228, 25)
(230, 301, 133)
(231, 389, 203)
(232, 374, 160)
(233, 282, 192)
(234, 298, 85)
(235, 217, 88)
(236, 175, 11)
(237, 314, 43)
(238, 362, 61)
(239, 388, 87)
(240, 258, 143)
(241, 189, 64)
(242, 25, 179)
(243, 201, 86)
(244, 60, 134)
(245, 398, 74)
(246, 196, 71)
(247, 237, 181)
(248, 174, 50)
(249, 41, 141)
(250, 283, 103)
(251, 142, 151)
(252, 386, 72)
(253, 50, 174)
(254, 43, 162)
(255, 226, 94)
(256, 38, 55)
(257, 120, 6)
(258, 304, 184)
(259, 351, 22)
(260, 371, 157)
(261, 357, 39)
(262, 145, 59)
(263, 318, 46)
(264, 25, 62)
(265, 124, 110)
(266, 80, 177)
(267, 319, 37)
(268, 294, 157)
(269, 244, 102)
(270, 131, 113)
(271, 116, 31)
(272, 280, 203)
(273, 398, 137)
(274, 321, 134)
(275, 367, 18)
(276, 130, 80)
(277, 232, 12)
(278, 395, 78)
(279, 364, 80)
(280, 88, 70)
(281, 94, 180)
(282, 391, 3)
(283, 101, 51)
(284, 148, 76)
(285, 255, 77)
(286, 108, 45)
(287, 316, 60)
(288, 369, 36)
(289, 61, 45)
(290, 212, 89)
(291, 157, 144)
(292, 365, 30)
(293, 392, 58)
(294, 347, 50)
(295, 124, 148)
(296, 317, 40)
(297, 50, 19)
(298, 9, 69)
(299, 6, 139)
(300, 14, 92)
(301, 38, 78)
(302, 247, 73)
(303, 19, 165)
(304, 167, 116)
(305, 137, 147)
(306, 305, 29)
(307, 106, 2)
(308, 237, 191)
(309, 199, 143)
(310, 116, 47)
(311, 337, 78)
(312, 100, 149)
(313, 395, 63)
(314, 108, 143)
(315, 246, 20)
(316, 352, 128)
(317, 83, 186)
(318, 9, 121)
(319, 280, 35)
(320, 58, 154)
(321, 36, 126)
(322, 256, 209)
(323, 48, 49)
(324, 315, 124)
(325, 125, 130)
(326, 252, 24)
(327, 147, 171)
(328, 53, 121)
(329, 257, 61)
(330, 390, 76)
(331, 345, 208)
(332, 216, 191)
(333, 31, 14)
(334, 98, 34)
(335, 181, 151)
(336, 350, 171)
(337, 206, 133)
(338, 244, 187)
(339, 394, 174)
(340, 205, 75)
(341, 8, 209)
(342, 324, 1)
(343, 210, 111)
(344, 169, 120)
(345, 191, 200)
(346, 107, 49)
(347, 324, 103)
(348, 63, 23)
(349, 127, 24)
(350, 133, 204)
(351, 99, 51)
(352, 149, 77)
(353, 60, 190)
(354, 162, 82)
(355, 238, 3)
(356, 126, 114)
(357, 185, 122)
(358, 110, 33)
(359, 230, 189)
(360, 268, 166)
(361, 52, 140)
(362, 130, 71)
(363, 128, 52)
(364, 224, 63)
(365, 368, 134)
(366, 63, 176)
(367, 135, 56)
(368, 144, 102)
(369, 165, 91)
(370, 340, 147)
(371, 3, 173)
(372, 20, 30)
(373, 306, 67)
(374, 54, 6)
(375, 283, 195)
(376, 207, 62)
(377, 109, 105)
(378, 332, 140)
(379, 215, 22)
(380, 198, 106)
(381, 59, 7)
(382, 51, 24)
(383, 374, 134)
(384, 121, 209)
(385, 60, 80)
(386, 171, 168)
(387, 75, 185)
(388, 331, 36)
(389, 231, 59)
(390, 157, 158)
(391, 332, 162)
(392, 157, 141)
(393, 51, 191)
(394, 360, 13)
(395, 327, 35)
(396, 208, 129)
(397, 98, 45)
(398, 285, 27)
(399, 269, 72)
(400, 75, 6)
(401, 270, 116)
(402, 344, 23)
(403, 278, 146)
(404, 320, 179)
(405, 269, 182)
(406, 188, 56)
(407, 252, 30)
(408, 45, 200)
(409, 178, 124)
(410, 222, 53)
(411, 291, 120)
(412, 211, 198)
(413, 105, 59)
(414, 354, 1)
(415, 317, 195)
(416, 48, 114)
(417, 143, 189)
(418, 388, 135)
(419, 181, 114)
(420, 310, 97)
(421, 37, 30)
(422, 208, 161)
(423, 21, 72)
(424, 342, 98)
(425, 41, 136)
(426, 384, 75)
(427, 276, 123)
(428, 116, 78)
(429, 5, 176)
(430, 258, 89)
(431, 172, 153)
(432, 57, 13)
(433, 399, 163)
(434, 359, 25)
(435, 307, 89)
(436, 238, 29)
(437, 257, 25)
(438, 90, 39)
(439, 289, 49)
(440, 241, 82)
(441, 192, 35)
(442, 237, 160)
(443, 35, 12)
(444, 306, 34)
(445, 212, 55)
(446, 389, 168)
(447, 342, 198)
(448, 377, 163)
(449, 302, 81)
(450, 323, 200)
(451, 354, 94)
(452, 315, 156)
(453, 208, 113)
(454, 377, 39)
(455, 159, 133)
(456, 269, 181)
(457, 384, 130)
(458, 43, 173)
(459, 15, 157)
(460, 245, 204)
(461, 34, 159)
(462, 112, 129)
(463, 264, 122)
(464, 118, 5)
(465, 369, 204)
(466, 312, 114)
(467, 30, 18)
(468, 44, 86)
(469, 379, 112)
(470, 348, 137)
(471, 201, 28)
(472, 351, 66)
(473, 355, 32)
(474, 68, 21)
(475, 211, 25)
(476, 391, 145)
(477, 244, 7)
(478, 22, 178)
(479, 182, 130)
(480, 270, 206)
(481, 283, 67)
(482, 48, 169)
(483, 376, 15)
(484, 115, 126)
(485, 314, 23)
(486, 97, 53)
(487, 4, 37)
(488, 382, 75)
(489, 30, 72)
(490, 77, 186)
(491, 121, 120)
(492, 121, 34)
(493, 54, 204)
(494, 289, 197)
(495, 69, 115)
(496, 205, 85)
(497, 19, 198)
(498, 56, 208)
(499, 129, 23)
(500, 195, 188)

In [42]:
conn.commit()

## Analisando estrutura da tabela pages_aluno_interesses

In [43]:
query = '''
SELECT sql
FROM sqlite_master
WHERE name = 'pages_aluno_interesses';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c[0])

CREATE TABLE "pages_aluno_interesses" ("id" integer NOT NULL PRIMARY KEY AUTOINCREMENT, "aluno_id_id" bigint NOT NULL REFERENCES "pages_aluno" ("id") DEFERRABLE INITIALLY DEFERRED, "interesses_id_id" bigint NOT NULL REFERENCES "pages_interesses" ("id") DEFERRABLE INITIALLY DEFERRED)

In [44]:
conn.commit()
conn.close()